_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 46, 46, 64)        640
_________________________________________________________________
batch_normalization_1 (Batch (None, 46, 46, 64)        256
_________________________________________________________________
activation_1 (Activation)    (None, 46, 46, 64)        0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 23, 23, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 23, 23, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 21, 21, 256)       147712
_________________________________________________________________
activation_2 (Activation)    (None, 21, 21, 256)       0
_________________________________________________________________
batch_normalization_2 (Batch (None, 21, 21, 256)       1024
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 10, 10, 256)       0
_________________________________________________________________
dropout_2 (Dropout)          (None, 10, 10, 256)       0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 8, 8, 512)         1180160
_________________________________________________________________
activation_3 (Activation)    (None, 8, 8, 512)         0
_________________________________________________________________
batch_normalization_3 (Batch (None, 8, 8, 512)         2048
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 512)         0
_________________________________________________________________
dropout_3 (Dropout)          (None, 4, 4, 512)         0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 2, 2, 512)         2359808
_________________________________________________________________
activation_4 (Activation)    (None, 2, 2, 512)         0
_________________________________________________________________
batch_normalization_4 (Batch (None, 2, 2, 512)         2048
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 1, 1, 512)         0
_________________________________________________________________
dropout_4 (Dropout)          (None, 1, 1, 512)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0
_________________________________________________________________
dense_1 (Dense)              (None, 256)               131328
_________________________________________________________________
batch_normalization_5 (Batch (None, 256)               1024
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0
_________________________________________________________________
dense_2 (Dense)              (None, 512)               131584
_________________________________________________________________
batch_normalization_6 (Batch (None, 512)               2048
_________________________________________________________________
dropout_6 (Dropout)          (None, 512)               0
_________________________________________________________________
dense_3 (Dense)              (None, 7)                 3591
=================================================================
Total params: 3,963,271
Trainable params: 3,959,047
Non-trainable params: 4,224
_________________________________________________________________